{
    "skyloft": "Enables progression items to appear on Skyloft.",
    "sky": "Enables progression items to appear in The Sky.",
    "thunderhead": "Enables progression items to appear in The Thunderhead.",
    "faron": "Enables progression items to appear in the Faron Province.",
    "eldin": "Enables progression items to appear in the Eldin Province.",
    "lanayru": "Enables progression items to appear in the Lanayru Province.",
    "dungeon": "Enables progression items to appear in dungeons (must be enabled).",
    "mini_dungeon": "Enables progression items to appear inside Mini Dungeons. Includes: Fire Node, Lightning Node, Top of LMF (unlocked after activating the nodes) and Pirate Stronghold.",
    "free_gift": "Enables progression items to appear as free gifts from NPCs. Includes: Fledge's Gift, Owlan's Gift, Potion Lady's Gift, Parrow's Gift, Wryna's Crystals and Golo's Gift.",
    "freestanding": "Enables progression items to appear as freestanding items in the world (does not include the freestanding gratitude crystals).",
    "miscellaneous": "Enables progression items to appear in miscellaneous locations that don't fit into any other category (i.e. overworld chests).",
    "silent_realm": "Enables progression items to appear as rewards for completing Silent Realm trials.",
    "digging": "Enables progression items to appear in important digging spots. Includes: the 5 digging spots in Eldin Volcano containing key pieces in vanilla, the digging spot in Skyview containing a small key in vanilla, Vent Chest in Earth Temple and the digging in Lanayru Gorge containing the Life Tree Seedling in vanilla.",
    "bombable": "Enables progression items to appear behind bombable walls and structures.",
    "combat": "Enables progression items to appear as as the result of combat. Does not impact combat within dungeons. Includes: Owlan's Crystals, Slingshot, Song from Levias, Digging Mitts Fight, Hook Beetle Fight in Lanayru Desert, the Temple of Time Goddess Cube and Rickety Coaster Minigame (unlocks after defeating Moldarach 2).",
    "song": "Enables progression items to appear in place of learning songs. Includes: Isle of Songs - Farore's Courage, Isle of Songs - Nayru's Wisdom, Isle of Songs - Din's Power, Song from Impa, Faron Soth, Lanayru Soth and Song from Levias.",
    "spiral_charge": "Enables progression items to appear in the chests in the sky requiring Spiral Charge to access.",
    "minigame": "Enables progression items to appear as rewards from winning minigames. Includes: Pumpkin Archery (600 points), Lumpy Pumpkin Harp Minigame, Fun Fun Island Minigame (500 rupees), Bug Heaven Minigame (10 bugs in 3 minutes) and Rickety Coaster Minigame (Heart Stopping Track in 1 minute 5 seconds).",
    "crystal": "Enables progression items to appear as loose crystals (currently not randomized and must always be enabled).",
    "short": "Enables progression items to appear as rewards for completing short quests. Includes: Parrow's Gift, Cawlin's Letter (NOT turning in the letter), Parrow's Crystals, Fledge's Crystals, Mallara's Crystals and Orielle's Crystals.",
    "long": "Enables progression items to appear as rewards for completing long quests. Includes: Peater/Peatrice's Crystals, Sparrot's Crystals, Owlan's Crystals, Lumpy Pumpkin Harp Minigame, Dodoh's Crystals, Fun Fun Island Minigame, Kina's Crystals, Slingshot (talk to Kikwis) and Faron Soth (tadtones).",
    "fetch": "Enables progression items to appear as rewards for returning items to NPCs. Includes: Bertie's Crystals (Baby Rattle turn-in), Ghost/Pipit's Crystals (Letter turn-in) and Beedle's Crystals (Horned Colossus Beetle turn-in).",
    "crystal_quest": "Enables progression items to appear as rewards for completing Gratitude Crystal quests. Includes: Wryna's Crystals, Peater/Peatrice's Crystals, Parrow's Crystals, Bertie's Crystals, Ghost/Pipit's Crystals, Mallara's Crystals, Owlan's Crystals, Orielle's Crystals, Kina's Crystals and Beedle's Crystals.",
    "scrapper": "Enables progression items to appear as rewards for Scrapper Quests. Includes: Sparrot's Crystals (deliver crystal ball), Owlan's Crystals (deliver Kikwi), Dodoh's Crystals (deliver party wheel), Fun Fun Island Minigame (unlocked after Dodoh's Crystals), Kina's Crystals (deliver Mogma) and Song from Levias (requires soup collection from Lumpy Pumpkin).",
    "peatrice": "Enables a progression item to appear as the reward for completing the Peatrice side quest.",
    "flooded_faron": "Enables progression items to appear in Flooded Faron: Includes Faron Soth (tadtones).",
    "goddess": "Enables progression items to appear as items in Goddess Chests.",
    "faron_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in Faron Woods and Deep Woods.",
    "eldin_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in the main part of Eldin Volcano and Mogma Turf.",
    "lanayru_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in the main part of Lanayru Desert, Temple of Time and Lanayru Mines.",
    "floria_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in Lake Floria.",
    "summit_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in Volcano Summit.",
    "sand_sea_goddess": "Enables progression items to appear in the Goddess Chests linked to the Goddess Cubes in Sand Sea."
}